tutorials/compressible/rhoPimpleFoam/RAS/aerofoilNACA0012/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitp
{
    type       limitPressure;

    minFactor  0.1;
    maxFactor  2;
}

limitT
{
    type       limitTemperature;

    min        101;
    max        1000;

    selectionMode all;
}

//************************************************************************** //
